console.log ("Test")
console.log("Test");

console.log("kva");
'number' + 3 + 3
var result = 'number' + 3 + 3;// відбулось склеювання (Конкатенація), число 3 перетворилося на рядок, потім додалось ще 3, яке теж перетворилось на рядок, тому відповідь буде текстом "number33"
console.log(result)
var result = null + 3;// null перетворюється на 0, тому далі рахуємо 0+3=3, відповідь буде 3
console.log(result)
var result = 5 && "qwerty"// && - це "логічне і", через те, що 2 значення є істинними, він поверне останнє значення, останнє у нас "qwerty", яке і є відповіддю
console.log(result)
var result = +'40' + +'2' + "hillel"; // унарний + пертворив строки на числа, далі відбулось сумування 40+2=42, далі відбулась конкатенація, тобто число 42 перетворилось на рядок і склеїлось з текстом, тому відповідь "42hillel"
console.log(result)
var result = '10' - 5 === 6; // через те, що у нас є -, рядок "10" перетворився на число, потім відбулося вичитання 10-5=5, потім відбулось строге порівняння 5===6, а так як 5 не равно 6, тому відповідь буде "false"
console.log(result)
var result = true + false; // true перетворюється на 1, а false перетворюється на 0, далі відбувається сумування 1+0=1, відповідь відповідно буде "1"
console.log(result)
var result = '4px' - 3; // значення '4px' не змогло перетворитися на число через наявність літер, тому нам видається помилка "NaN" (що означає Not a number), відповідь - "NaN"
console.log(result)
var result = '4' - 3; // рядок "4" перетворюється на число, далі відбувається вичитання 4-3=1, тобто відповідь буде "1"
console.log(result)
var result = '6' + 3 ** 0; //  число 3 підноситься до степеня 0, а степень 0 завжди дорівнює 1, тобто "3 ** 0" буде дорівнюватись 0, далі склеюємо 6 і 1 (бо 6 у нас рядок, а не число), відповідь буде "61"
console.log(result)
var result = 12 / '6'; // строка "6" перетворюється на число (так як у нас ділення, з яким це можливо), а потім відбувається ділення 12/6, відповідь буде 2
console.log(result)
var result = '10' + (5 === 6); // так як 5 не дорівнює 6, ми отримуємо false, "10" конкатенується з false, отримуємо відповідь 10false
console.log(result)
var result = null == ''; // відбувається нестроге порівнювання з пустим значенням, а при порівннянні null з пустим рядком буде видавтися false, тому відповідь false
console.log(result)
var result = 3 ** (9 / 3); // першим кроком виконується ділення у дужках 9/3 (отримали 3), після цього відбувається привод у ступінь "3 в ступені 3", і відповідь вийде 27
console.log(result)
var result = !!'false' == !!'true'; // як 'false' , так і 'true' є непорожніми рядками, а непорожні рядки - це true при перетворенні у булеве значення, тому отримуємо "true == true", результат буде true. Відповідь - true
console.log(result)
var result = 0 || '0' && 1; // спочатку перевіряється && (бо має вищий пріоритет), '0' && 1, перевіряємо, що обидва операнди є "істинними", тому повертається останне значення - 1. Далі переверяється, чи є 0 неправдивим (false), а він є. '0' є рядком, тому він буде true. Повертається перше істенне значення, тому повертається '0'. Відповідь буде 1.
console.log(result)
var result = (+null == false) < 1; // +null перетворює null на число (0), потім порівнюється число 0 з false, що також перетворюється на число, і виходить ноль. 0=0, тому буде true. Потім первіряється (true) < 1, і true стає 1, а false стає 0, тому що булеве значення (true) перетворюється на число. Далі аналізуємо вираз 1 < 1,бачимо, що це неправда, тому відповідь буде false.
console.log(result)
var result = false && true || true; // Спочатку перевіряємо false && true (пріоритет вищий), отримуємо false, тому що перший операнд є false, потім перевіряємо false || true. Так як один з операндів true, оператор || повертає true. Відповідь true.
console.log(result)
var result = false && (false || true); // Спочатку виконується операція в дужках, false || true. Отримуємо true, бо хоча б один з операндів у нас true. Далі виконуємо false && true, результатом буде false, бо тільки 1 операнд true. Відповідь буде true.
console.log(result)
var result = (+null == false) < 1 ** 5; // null перетворюється на число (0), далі виконується нестроге порівнювання, в якому false перетворюється на число (теж 0), 0=0, тобто true. Далі перевіряємо  true < 1 ** 5. 1 підноситься у ступень 5, виходить 1. Отримали true < 1. І так як true перетворившись на число, буде 1, то 1<1 буде невірним значенням. Том відповідь - false.
console.log(result)